<template>
  <div class="courseexam">
    <div class="row">
      <div class="col-12 title">
        <i class="fa fa-list"></i> اسئلة الدورة
      </div>
      <div class="col-12">
        <div class="ul">
          <li v-for="quest in questions" :key="quest.id">
            <div class="row">
              <div class="col-9">
                <div class="row">
                  <div class="col-12">
                    <div class="row">
                      <div class="col-3">
                        <img src="../../../assets/course/Ellipse_46.png" alt="">
                      </div>
                      <div class="col-6">
                        <h4> {{ quest.name}} </h4>
                        <div>{{ quest.since }} </div>
                      </div>
                    </div>
                  </div>
                  <div class="col-12">
                    <p> {{ quest.content }}</p>
                  </div>
                  <div class="col-1"></div>
                  <div class="col-10">
                    <h5>الاجابة</h5>
                    <p>{{ quest.answer }}</p>
                  </div>
                </div>
              </div>
            </div>
          </li>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      questions: [
        {

          id: 1,
          name:'سيد فرج الله',
          since:'منذ ساعتين',
          content:'ما هي المادة ؟ ',
          answer: "الخلية هي الوحدة الأساسية للحياة . وسواء كنا نتحدث عن كونها مكونة من خلية (وحيدة الخلية) أو مجموعة منها (متعددة الخلايا) ، فإن هذا العنصر موجود دائمًا. وبفضل تمايزها في الوظائف ، أفسح التطور المجال للكائنات الحية المعقدة بشكل متزايد.  ",
        },
        {
          id: 2,
          name: 'سيد فرج الله',
          since:'منذ ساعتين',
          content: 'ما هي المادة ؟ ',
          answer: "الخلية هي الوحدة الأساسية للحياة . وسواء كنا نتحدث عن كونها مكونة من خلية (وحيدة الخلية) أو مجموعة منها (متعددة الخلايا) ، فإن هذا العنصر موجود دائمًا. وبفضل تمايزها في الوظائف ، أفسح التطور المجال للكائنات الحية المعقدة بشكل متزايد.  ",
        },
        {
          id: 3,
          name: 'سيد فرج الله',
          since:'منذ ساعتين',
          content: 'ما هي المادة ؟ ',
          answer: "الخلية هي الوحدة الأساسية للحياة . وسواء كنا نتحدث عن كونها مكونة من خلية (وحيدة الخلية) أو مجموعة منها (متعددة الخلايا) ، فإن هذا العنصر موجود دائمًا. وبفضل تمايزها في الوظائف ، أفسح التطور المجال للكائنات الحية المعقدة بشكل متزايد.  ",
        },
        {
          id: 4,
          name: 'سيد فرج الله',
          since:'منذ ساعتين',
          content: 'ما هي المادة ؟ ',
          answer: "الخلية هي الوحدة الأساسية للحياة . وسواء كنا نتحدث عن كونها مكونة من خلية (وحيدة الخلية) أو مجموعة منها (متعددة الخلايا) ، فإن هذا العنصر موجود دائمًا. وبفضل تمايزها في الوظائف ، أفسح التطور المجال للكائنات الحية المعقدة بشكل متزايد.  ",
        },
        {
          id: 5,
          name: 'سيد فرج الله',
          since:'منذ ساعتين',
          content: 'ما هي المادة ؟ ',
          answer: "الخلية هي الوحدة الأساسية للحياة . وسواء كنا نتحدث عن كونها مكونة من خلية (وحيدة الخلية) أو مجموعة منها (متعددة الخلايا) ، فإن هذا العنصر موجود دائمًا. وبفضل تمايزها في الوظائف ، أفسح التطور المجال للكائنات الحية المعقدة بشكل متزايد.  ",
        },
        {
          id: 6,
          name: 'سيد فرج الله',
          since:'منذ ساعتين',
          content: 'ما هي المادة ؟ ',
          answer: "الخلية هي الوحدة الأساسية للحياة . وسواء كنا نتحدث عن كونها مكونة من خلية (وحيدة الخلية) أو مجموعة منها (متعددة الخلايا) ، فإن هذا العنصر موجود دائمًا. وبفضل تمايزها في الوظائف ، أفسح التطور المجال للكائنات الحية المعقدة بشكل متزايد.  ",
        },
        {
          id: 7,
          name: 'سيد فرج الله',
          since:'منذ ساعتين',
          content: 'ما هي المادة ؟ ',
          answer: "الخلية هي الوحدة الأساسية للحياة . وسواء كنا نتحدث عن كونها مكونة من خلية (وحيدة الخلية) أو مجموعة منها (متعددة الخلايا) ، فإن هذا العنصر موجود دائمًا. وبفضل تمايزها في الوظائف ، أفسح التطور المجال للكائنات الحية المعقدة بشكل متزايد.  ",
        },
        {
          id: 8,
          name: 'سيد فرج الله',
          since:'منذ ساعتين',
          content: 'ما هي المادة ؟ ',
          answer: "الخلية هي الوحدة الأساسية للحياة . وسواء كنا نتحدث عن كونها مكونة من خلية (وحيدة الخلية) أو مجموعة منها (متعددة الخلايا) ، فإن هذا العنصر موجود دائمًا. وبفضل تمايزها في الوظائف ، أفسح التطور المجال للكائنات الحية المعقدة بشكل متزايد.  ",
        },
      ]
    }
  },
}
</script>

<style lang="scss">

</style>